# parameters
nc: 80  # number of classes
depth_multiple: 0.25  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# anchors
anchors:
  - [8,13, 31,15, 68,45]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.ReLU6()]],  # 0-P1/2  
   [-1, 1, MP, []],
   #[-1, 1, Conv, [64, 3, 2, None, 1, nn.ReLU6()]],  # 1-P2/4    
   
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.ReLU6()]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU6()]],  # 7
   
   [-1, 1, MP, []],  # 8-P3/8
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.ReLU6()]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU6()]],  # 14
   
   [-1, 1, MP, []],  # 15-P4/16
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.ReLU6()]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],  # 21
   
   [-1, 1, MP, []],  # 22-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.ReLU6()]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.ReLU6()]],  # 28
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],  # 37 (after sppspc)
  
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU6()]],
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.ReLU6()]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.ReLU6()]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU6()]],  # 42
      
   [-1, 1, Conv, [512, 3, 1, None, 1, nn.ReLU6()]], # 43 

   [[44], 1, IDetect, [nc, anchors]],   # Detect
  ]
